Revit API Introduction Labs
Lab6_2_Ribbon.OnStartup Method
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public Result OnStartup(
	UIControlledApplication a
)
Visual Basic (Declaration)
Public Function OnStartup ( _
	a As UIControlledApplication _
) As Result
Visual C++
public:
virtual Result OnStartup(
	UIControlledApplication^ a
) sealed
Parameters
a
Type: UIControlledApplication
Implements
IExternalApplicationOnStartup(UIControlledApplication)
See Also
Lab6_2_Ribbon Class
Labs Namespace